/*
Урок №43 JavaScript
Розуміння модулів JavaScript та імпорту-експорту
*/
/* Приклад №1 модулів у CommonJS 
// Оголошуємо функцію `add`, яка приймає два аргументи `a` та `b` та повертає їх суму
const add = (a, b) => {
    return a + b;
}

// Оголошуємо функцію `subtract`, яка приймає два аргументи `a` та `b` та повертає їх різницю
const subtract = (a, b) => {
    return a - b;
}

// Експортуємо функції `add` та `subtract` з модуля
module.exports = {
    add,
    subtract,
}
*/

/* Приклад №2 використовує сучасну систему модулів у ES6
// Оголошуємо функцію add_1, яка приймає два аргументи a та b і повертає їх суму
const add_1 = (a, b) => {
    return a + b;
}

// Оголошуємо функцію substract_1, яка приймає два аргументи a та b і повертає їх різницю
const substract_1 = (a, b) => {
    return a - b;
}

// Експортуємо функції add_1 та substract_1 для використання в інших модулях
export {add_1, substract_1}
*/



// Приклад №3
// Експортуємо функцію add_2, яка приймає два аргументи a та b і повертає їх суму
export const add_2 = (a, b) => {
    return a + b;
}

// Експортуємо функцію substract_2, яка приймає два аргументи a та b і повертає їх різницю
export const substract_2 = (a, b) => {
    return a - b;
}



