/*
function great() {
    alert('19.12.2023; 14:15');
}
*/
/*
let age;
age = 'Hi';
console.log(age);
*/

/*
Домашнє завдання урок №3
Напишіть JavaScript-код, 
який створює дві змінні: `number1` зі значенням 10 та `number2` зі значенням 5.
Потім напишіть вираз, який використовує арифметичний 
оператор додавання для обчислення суми цих двох 
чисел і виводить результат у консоль.
*/

/*
Створюємо змінну `number1` зі значенням 10.
*/
let number1 = 10;

/*
Створюємо змінну `number2` зі значенням 5.
*/
let number2 = 5;

/*
Обчислюємо суму двох змінних `number1` та `number2`.
*/
let result = number1 + number2;

/*
Виводимо результат у консоль.
*/
console.log(result);
