/*
function great() {
    alert('19.12.2023; 14:15');
}
*/
/*
let age;
age = 'Hi';
console.log(age);
*/

/*
Домашнє завдання урок №3
Напишіть JavaScript-код, 
який створює дві змінні: `number1` зі значенням 10 та `number2` зі значенням 5.
Потім напишіть вираз, який використовує арифметичний 
оператор додавання для обчислення суми цих двох 
чисел і виводить результат у консоль.


/*
Створюємо змінну `number1` зі значенням 10.
*
let number1 = 10;

/*
Створюємо змінну `number2` зі значенням 5.
*
let number2 = 5;

/*
Обчислюємо суму двох змінних `number1` та `number2`.
*
let result = number1 + number2;

/*
Виводимо результат у консоль.
*
console.log(result);
*/




/*
Урок номер №4
Як використовувати if/else для умовної логіки


/*
Створюємо змінні
*
let isRaining = false; // Чи йде дощ?
let isCloudy = true; // Чи хмарно?
let temperature = 18; // Температура

/*
Перевіряємо, чи йде дощ
*
if (isRaining) {
  // Якщо так, то рекомендуємо взяти парасольку
  console.log('Take an umbrella');
}

/*
Інакше перевіряємо, чи хмарно
*
else if (isCloudy) {
  // Якщо так, то рекомендуємо взяти легкий жакет
  console.log('Maybe take a light jacket');
}

/*
Інакше погода хороша, і ми можемо насолоджуватися сонцем
*
else {
  console.log('Enjoy the sunshine');
}

/*
Перевіряємо, чи холодно
*
if (temperature <= 20) {
  // Якщо так, то попереджуємо користувача
  console.log('It`s a chily outside'); *
}
*/




/*
Домашнє завдання урок №4
Напишіть код на JavaScript, в якому використовуються змінні `temperature` та `isWindy`.
Використовуйте оператори if/else для виведення різних повідомлень в консоль,
залежно від значень цих змінних
(наприклад, якщо температура нижче 15 градусів і вітряно,
виведіть "Вдягніться тепліше і візьміть шапку",
інакше якщо температура вище 15 градусів і не вітряно,
виведіть "Хороший день для прогулянки").
*/

/*
Створюємо змінні
*/
let temperature = 20; // Температура
let isWindy = true; // Чи вітряно?

/*
Перевіряємо, чи температура нижче 15 градусів і вітряно
*/
if (temperature <= 15 && isWindy) {
  // Якщо так, то рекомендуємо одягнутися тепліше
  console.log('Вдягніться тепліше і візьміть шапку');
}

/*
Інакше, якщо температура вище 15 градусів,
то погода хороша і ми можемо насолоджуватися прогулянкою
*/
else {
  console.log('Хороший день для прогулянки');
}
