/*
function great() {
    alert('19.12.2023; 14:15');
}
*/
/*
let age;
age = 'Hi';
console.log(age);
*/

/*
Домашнє завдання урок №3
Напишіть JavaScript-код, 
який створює дві змінні: `number1` зі значенням 10 та `number2` зі значенням 5.
Потім напишіть вираз, який використовує арифметичний 
оператор додавання для обчислення суми цих двох 
чисел і виводить результат у консоль.


/*
Створюємо змінну `number1` зі значенням 10.
*
let number1 = 10;

/*
Створюємо змінну `number2` зі значенням 5.
*
let number2 = 5;

/*
Обчислюємо суму двох змінних `number1` та `number2`.
*
let result = number1 + number2;

/*
Виводимо результат у консоль.
*
console.log(result);
*/




/*
Урок номер №4
Як використовувати if/else для умовної логіки


/*
Створюємо змінні
*
let isRaining = false; // Чи йде дощ?
let isCloudy = true; // Чи хмарно?
let temperature = 18; // Температура

/*
Перевіряємо, чи йде дощ
*
if (isRaining) {
  // Якщо так, то рекомендуємо взяти парасольку
  console.log('Take an umbrella');
}

/*
Інакше перевіряємо, чи хмарно
*
else if (isCloudy) {
  // Якщо так, то рекомендуємо взяти легкий жакет
  console.log('Maybe take a light jacket');
}

/*
Інакше погода хороша, і ми можемо насолоджуватися сонцем
*
else {
  console.log('Enjoy the sunshine');
}

/*
Перевіряємо, чи холодно
*
if (temperature <= 20) {
  // Якщо так, то попереджуємо користувача
  console.log('It`s a chily outside'); *
}
*/




/*
Домашнє завдання урок №4
Напишіть код на JavaScript, в якому використовуються змінні `temperature` та `isWindy`.
Використовуйте оператори if/else для виведення різних повідомлень в консоль,
залежно від значень цих змінних
(наприклад, якщо температура нижче 15 градусів і вітряно,
виведіть "Вдягніться тепліше і візьміть шапку",
інакше якщо температура вище 15 градусів і не вітряно,
виведіть "Хороший день для прогулянки").


/*
Створюємо змінні
*
let temperature = 20; // Температура
let isWindy = true; // Чи вітряно?

/*
Перевіряємо, чи температура нижче 15 градусів і вітряно
*
if (temperature <= 15 && isWindy) {
  // Якщо так, то рекомендуємо одягнутися тепліше
  console.log('Вдягніться тепліше і візьміть шапку');
}

/*
Інакше, якщо температура вище 15 градусів,
то погода хороша і ми можемо насолоджуватися прогулянкою
*
else {
  console.log('Хороший день для прогулянки');
}
*/

/*
// Урок №5 - Демонстрація циклів for, while і do-while

// Цикл for:
// ---------
// - Оголошує змінну i та ініціалізує її значенням 0.
//     - i буде використовуватися як лічильник циклу.
// - Умова i < 5 визначає, чи буде виконуватися цикл.
//     - Цикл буде виконуватися, поки i менше 5.
// - i++ збільшує значення i на 1 після кожної ітерації.
for (let i = 0; i < 5; i++) {
    // Виводить повідомлення "Ітерація" з поточним значенням i.
    console.log('Ітерація' + i);
  }
  
  // Цикл while:
  // ---------
  // - Оголошує змінну count та ініціалізує її значенням 0.
  let count = 0;
  // - Умова count < 5 визначає, чи буде виконуватися цикл.
  //     - Цикл буде виконуватися, поки count менше 5.
  while (count < 5) {
    // Виводить повідомлення "Ітерація" з поточним значенням count.
    console.log("Ітерація " + count);
    // Збільшує значення count на 1 після кожної ітерації.
    count++;
  }
  
  // Цикл do-while:
  // ---------
  // - Оголошує змінну num та ініціалізує її значенням 0.
  let num = 0;
  // - Виконує блок коду хоча б один раз, а потім перевіряє умову.
  do {
    // Виводить повідомлення "Ітерація" з поточним значенням num.
    console.log('Ітерація ' + num);
    // Збільшує значення num на 1 після кожної ітерації.
    num++;
  // - Умова num < 5 визначає, чи буде цикл виконуватися знову.
  //     - Цикл буде повторюватися, поки num менше 5.
  } while (num < 5);
  */

/*
Домашнє завдання урок №5
Напишіть фрагмент коду на JavaScript, який використовує цикл `for`, щоб вивести на консоль числа від 1 до 10.


for (let i = 1; i <= 10; i++) {
    console.log(i);
}

*/



/*
// Урок №6

/*
Створюємо масив `fruits` з елементами "apple", "banana", "cherry".
*
let fruits = ['apple', 'banana', 'cherry'];

/*
Отримуємо перший елемент масиву `fruits`.
*
let firstFruit = fruits[0];

/*
Додаємо елемент "orange" до кінця масиву `fruits`.
*
fruits.push('orange');

/*
Отримуємо останній елемент масиву `fruits`.
*
let removedFruit = fruits.pop();

/*
Отримуємо перший елемент масиву `fruits` і видаляємо його.
*
let firstRemoved = fruits.shift();

/*
Додаємо елемент "grape" на початок масиву `fruits`.
*
fruits.unshift('grape');

/*
Виводимо масив `fruits` на консоль.
*
console.log(fruits);

*/






/*
Домашнє завдання урок №6
Створюємо масив `vegetables` з елементами "carrot", "potato", "cucumber".

let vegetables = ["carrot", "potato", "cucumber"];

/*
Додаємо елемент "tomato" до кінця масиву `vegetables`.
*
vegetables.push('tomato');

/*
Видаляємо перший елемент масиву `vegetables`.
*
vegetables.shift();

/*
Виводимо масив `vegetables` на консоль.
*
console.log(vegetables);
*/





/*
Урок №7 Функції
/*
Функція `sayHello()` виводить повідомлення "Hello World" на консоль.
*
function sayHello() {
    // Виводимо повідомлення "Hello World" на консоль.
    console.log('Hello World');
  }
  
  sayHello();
  */


  /*
  Домашнє завдання урок №7
  Напишіть функцію на JavaScript, 
  яка приймає два числові параметри та повертає їхню суму. 
  Після цього викличте цю функцію, 
  передавши їй два числа на ваш вибір, 
  та виведіть результат у консоль.
  */
  
  /*
  Функція `num()` приймає два числові параметри `a` і `b` і повертає їхню суму.
  */
  function num(a, b) {
    // Повертає суму двох параметрів.
    return a + b;
  }
  
  console.log(num(5, 10));
  